# OriginalFillPatternName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportPatternKey..::..OriginalFillPatternName Property
ExportPatternKey Class See Also
---
The original FillPattern name.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public string OriginalFillPatternName { get; set; }
```

Visual Basic
---
```text
Public Property OriginalFillPatternName As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ OriginalFillPatternName {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
ExportPatternKey Class
Autodesk.Revit.DB Namespace